ext/DataProcessors/ТЗ_ПечатьПриказовНаПремию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ТЗ_ПечатьПриказовНаПремию</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ext/Catalogs/ТЗ_ПрисоединенныеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТЗ_ПрисоединенныеФайлы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Премия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеФайла</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФормирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ext/DataProcessors/ТЗ_ПечатьПриказовНаПремию/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Список сотрудников документа "Премия": одна строка на сотрудника,
// кадровые данные - на дату документа.
//
// Параметры:
//  Документ   - ДокументСсылка.Премия
//  Сотрудники - Массив, Неопределено - отбор по сотрудникам; Неопределено - все.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Сотрудник, ФИО, ТабельныйНомер, Должность, Подразделение, Сумма.
//  Пустая, если документ не проведен или недоступен пользователю по правам.
//
Функция СотрудникиДокумента(Документ, Сотрудники = Неопределено) Экспорт

	Шапка = ДанныеШапки(Документ);
	Если Шапка = Неопределено Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Строки.Сотрудник КАК Сотрудник,
	|	СУММА(Строки.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТСуммы
	|ИЗ
	|	Документ.Премия.Сотрудники КАК Строки
	|ГДЕ
	|	Строки.Ссылка = &Документ
	|	И (&БезОтбора
	|			ИЛИ Строки.Сотрудник В (&Сотрудники))
	|
	|СГРУППИРОВАТЬ ПО
	|	Строки.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТСуммы.Сотрудник КАК Сотрудник,
	|	ВТСуммы.Сотрудник.Наименование КАК ФИО,
	|	ВТСуммы.Сотрудник.ТабельныйНомер КАК ТабельныйНомер,
	|	ЕСТЬNULL(Кадры.Должность, ВТСуммы.Сотрудник.Должность) КАК Должность,
	|	ЕСТЬNULL(Кадры.Подразделение, ВТСуммы.Сотрудник.Подразделение) КАК Подразделение,
	|	ВТСуммы.Сумма КАК Сумма
	|ИЗ
	|	ВТСуммы КАК ВТСуммы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(
	|				&ДатаДокумента,
	|				Сотрудник В
	|					(ВЫБРАТЬ
	|						ВТСуммы.Сотрудник
	|					ИЗ
	|						ВТСуммы)) КАК Кадры
	|		ПО ВТСуммы.Сотрудник = Кадры.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФИО";

	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("ДатаДокумента", Шапка.Дата);
	Запрос.УстановитьПараметр("БезОтбора", Сотрудники = Неопределено);
	Запрос.УстановитьПараметр("Сотрудники", ?(Сотрудники = Неопределено, Новый Массив, Сотрудники));

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Формирует отдельный приказ на каждого сотрудника и, при необходимости,
// прикрепляет каждый приказ к документу отдельным PDF.
//
// Параметры:
//  Документ        - ДокументСсылка.Премия
//  Сотрудники      - Массив из СправочникСсылка.Сотрудники - отмеченные сотрудники.
//  ПрикрепитьФайлы - Булево
//
// Возвращаемое значение:
//  Структура:
//   * ПечатныеФормы  - Массив из Структура (Заголовок, ТабличныйДокумент, Ключ)
//   * НеПрикреплены  - Массив из Строка - по каким сотрудникам не удалось прикрепить PDF и почему.
//   * Ошибка         - Строка - общая ошибка (документ недоступен и т.п.).
//
Функция СформироватьПриказы(Документ, Сотрудники, ПрикрепитьФайлы = Истина) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("ПечатныеФормы", Новый Массив);
	Результат.Вставить("НеПрикреплены", Новый Массив);
	Результат.Вставить("Ошибка", "");

	Шапка = ДанныеШапки(Документ);
	Если Шапка = Неопределено Тогда
		Результат.Ошибка = НСтр("ru = 'Документ не проведен или недоступен по правам.'");
		Возврат Результат;
	КонецЕсли;

	ДанныеСотрудников = СотрудникиДокумента(Документ, Сотрудники);
	СтрокиПремии      = СтрокиПремииСотрудников(Документ, Сотрудники);

	// Макет и его области получаем один раз, а не на каждого сотрудника.
	Макет = ПолучитьМакет("ТЗ_ПриказОПоощрении");
	Области = Новый Структура;
	Для Каждого ИмяОбласти Из СтрРазделить("Шапка,ШапкаТаблицы,Строка,Итого,Подвал", ",") Цикл
		Области.Вставить(ИмяОбласти, Макет.ПолучитьОбласть(ИмяОбласти));
	КонецЦикла;

	Подписант = Новый Структура;
	Подписант.Вставить("Руководитель", Константы.РуководительОрганизации.Получить());
	Подписант.Вставить("ДолжностьРуководителя", Константы.ДолжностьРуководителя.Получить());

	Для Каждого Сотрудник Из ДанныеСотрудников Цикл

		СтрокиСотрудника = СтрокиПремии.НайтиСтроки(Новый Структура("Сотрудник", Сотрудник.Сотрудник));
		ТабДок = ПриказСотрудника(Области, Шапка, Сотрудник, СтрокиСотрудника, Подписант);

		ПечатнаяФорма = Новый Структура;
		ПечатнаяФорма.Вставить("Заголовок", СтрШаблон(НСтр("ru = 'Приказ - %1'"), Сотрудник.ФИО));
		ПечатнаяФорма.Вставить("ТабличныйДокумент", ТабДок);
		ПечатнаяФорма.Вставить("Ключ", Строка(Сотрудник.Сотрудник.УникальныйИдентификатор()));
		Результат.ПечатныеФормы.Добавить(ПечатнаяФорма);

		Если Не ПрикрепитьФайлы Тогда
			Продолжить;
		КонецЕсли;

		// Ошибка по одному сотруднику не должна остановить остальных:
		// каждый файл записывается в своей транзакции.
		Попытка
			ПрикрепитьПриказ(Документ, Сотрудник.Сотрудник, ИмяФайлаПриказа(Шапка, Сотрудник.ФИО), ТабДок);
		Исключение
			Результат.НеПрикреплены.Добавить(СтрШаблон("%1: %2",
				Сотрудник.ФИО, КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
		КонецПопытки;

	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Реквизиты шапки документа. Неопределено - документ не проведен,
// помечен на удаление или недоступен пользователю (РАЗРЕШЕННЫЕ).
Функция ДанныеШапки(Документ)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Премия.Номер КАК Номер,
	|	Премия.Дата КАК Дата,
	|	Премия.Организация КАК Организация
	|ИЗ
	|	Документ.Премия КАК Премия
	|ГДЕ
	|	Премия.Ссылка = &Документ
	|	И Премия.Проведен
	|	И НЕ Премия.ПометкаУдаления";
	Запрос.УстановитьПараметр("Документ", Документ);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Шапка = Новый Структура("Номер, Дата, Организация");
	ЗаполнитьЗначенияСвойств(Шапка, Выборка);
	Возврат Шапка;

КонецФункции

// Все строки премии отмеченных сотрудников - для блока "Премия" в приказе.
Функция СтрокиПремииСотрудников(Документ, Сотрудники)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Строки.Сотрудник КАК Сотрудник,
	|	Строки.ВидПремии КАК ВидПремии,
	|	Строки.Сумма КАК Сумма
	|ИЗ
	|	Документ.Премия.Сотрудники КАК Строки
	|ГДЕ
	|	Строки.Ссылка = &Документ
	|	И Строки.Сотрудник В (&Сотрудники)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Строки.НомерСтроки";
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);

	Таблица = Запрос.Выполнить().Выгрузить();
	Таблица.Индексы.Добавить("Сотрудник");
	Возврат Таблица;

КонецФункции

Функция ПриказСотрудника(Области, Шапка, Сотрудник, СтрокиСотрудника, Подписант)

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.КлючПараметровПечати = "ТЗ_ПриказОПоощренииРаботника";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;

	Область = Области.Шапка;
	Область.Параметры.Организация   = Шапка.Организация;
	Область.Параметры.Номер         = Шапка.Номер;
	Область.Параметры.Дата          = Формат(Шапка.Дата, "ДЛФ=DD");
	Область.Параметры.ФИО           = Сотрудник.ФИО;
	Область.Параметры.ТабельныйНомер = Сотрудник.ТабельныйНомер;
	Область.Параметры.Должность     = Сотрудник.Должность;
	Область.Параметры.Подразделение = Сотрудник.Подразделение;
	ТабДок.Вывести(Область);

	ТабДок.Вывести(Области.ШапкаТаблицы);

	Итого = 0;
	НомерСтроки = 0;
	Для Каждого СтрокаПремии Из СтрокиСотрудника Цикл
		НомерСтроки = НомерСтроки + 1;
		Область = Области.Строка;
		Область.Параметры.НомерСтроки = НомерСтроки;
		Область.Параметры.ВидПремии   = СтрокаПремии.ВидПремии;
		Область.Параметры.Сумма       = СтрокаПремии.Сумма;
		ТабДок.Вывести(Область);
		Итого = Итого + СтрокаПремии.Сумма;
	КонецЦикла;

	Область = Области.Итого;
	Область.Параметры.Итого = Итого;
	ТабДок.Вывести(Область);

	Область = Области.Подвал;
	Область.Параметры.ДолжностьРуководителя = Подписант.ДолжностьРуководителя;
	Область.Параметры.Руководитель  = Подписант.Руководитель;
	Область.Параметры.ФИОСотрудника = Сотрудник.ФИО;
	ТабДок.Вывести(Область);

	Возврат ТабДок;

КонецФункции

// "Приказ №2 от 20.09.2026 - Иванов Иван Иванович.pdf"
Функция ИмяФайлаПриказа(Шапка, ФИО)

	Номер = СокрЛП(Шапка.Номер);
	Пока СтрНачинаетсяС(Номер, "0") И СтрДлина(Номер) > 1 Цикл
		Номер = Сред(Номер, 2);
	КонецЦикла;

	ИмяФайла = СтрШаблон("Приказ №%1 от %2 - %3.pdf", Номер, Формат(Шапка.Дата, "ДФ=dd.MM.yyyy"), ФИО);

	// Символы, недопустимые в именах файлов Windows/macOS.
	Для Каждого Символ Из СтрРазделить("\,/,:,*,?,"",<,>,|", ",") Цикл
		ИмяФайла = СтрЗаменить(ИмяФайла, Символ, "_");
	КонецЦикла;

	Возврат ИмяФайла;

КонецФункции

// Один файл на пару "документ + сотрудник": если файл уже есть - перезаписывается,
// иначе создается. Так повторная печать не плодит дубли.
Процедура ПрикрепитьПриказ(Документ, Сотрудник, ИмяФайла, ТабДок)

	Поток = Новый ПотокВПамяти;
	ТабДок.Записать(Поток, ТипФайлаТабличногоДокумента.PDF);
	ДанныеPDF = Поток.ЗакрытьИПолучитьДвоичныеДанные();

	НачатьТранзакцию();
	Попытка

		Блокировка = Новый БлокировкаДанных;
		Блокировка.Добавить("Справочник.ТЗ_ПрисоединенныеФайлы");
		Блокировка.Заблокировать();

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Файлы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТЗ_ПрисоединенныеФайлы КАК Файлы
		|ГДЕ
		|	Файлы.Документ = &Документ
		|	И Файлы.Сотрудник = &Сотрудник";
		Запрос.УстановитьПараметр("Документ", Документ);
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		Выборка = Запрос.Выполнить().Выбрать();

		Если Выборка.Следующий() Тогда
			Файл = Выборка.Ссылка.ПолучитьОбъект();
		Иначе
			Файл = Справочники.ТЗ_ПрисоединенныеФайлы.СоздатьЭлемент();
			Файл.Документ  = Документ;
			Файл.Сотрудник = Сотрудник;
		КонецЕсли;

		Файл.Наименование     = ИмяФайла;
		Файл.ДанныеФайла      = Новый ХранилищеЗначения(ДанныеPDF, Новый СжатиеДанных(9));
		Файл.ДатаФормирования = ТекущаяДатаСеанса();
		Файл.ПометкаУдаления  = Ложь;
		Файл.Записать();

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
